/*-----------------------------------------------
  名称：单个共阳数码管动态显示变化数字
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过循环赋值给P1，让数码管显示特定的字符或者数字
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义
#define uint unsigned int
sbit P30 = P3^0;
//unsigned char code display_table[10]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,};
 // 显示数值表0-9
code uint SEG_CODE[ ] = { 0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F};
void Delay(unsigned int t); //函数声明
/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{
 unsigned char i;  //定义一个无符号字符型局部变量 i 取值范围 0~255
 P30 = 0;
 while (1)         //主循环
  {
  for(i=0;i<10;i++)   //加入 for循环，表明for循环大括号中的程序循环执行10次
  {
  P1=SEG_CODE[i]; //循环调用表中的数值
  Delay(6000000);      //延时，方便观看数字变化
  }

                     //主循环中添加其他需要一直工作的程序
  }
}/*------------------------------------------------
 延时函数，含有输入参数 unsigned int t，无返回值
 unsigned int 是定义无符号整形变量，其值的范围是
 0~65535
------------------------------------------------*/
void Delay(unsigned long int t)
{
 while(--t);
}